# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

num1 = 111
num2 = 222
string1 = 'text'

print(num1)
print(num2)
print(string1)

a = input('Введите любое число: ')

print(a)